# Rebar Shape Terminations Data Is Valid Object Property

Source: https://www.revitapidocs.com/2026/3fa56b2e-0d02-95fa-fd3d-3d252dce6c68.htm

---

| Rebar Shape Terminations Data Is Valid Object Property |
| --- |

Specifies whether the .NET object represents a valid Revit entity.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public bool IsValidObject { get; }
```

```
Public ReadOnly Property IsValidObject As Boolean
	Get
```

```
public:
property bool IsValidObject {
	bool get ();
}
```

```
member IsValidObject : bool with get
```

#### Return Value

Boolean
True if the API object holds a valid Revit native object, false otherwise. Remarks If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
 a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects. See Also

#### Reference

RebarShapeTerminationsData Class Autodesk.Revit.DB.Structure Namespace